frontend/models/ProductForm.php

    public function getProductAll()  :array
    {
      return $this->query->from('product')->all();
---
SELECT * FROM `product`